src/cfe/InformationRegisters/кбп_ЖурналПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>кбп_ЖурналПроцессов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидЗаписи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.кбп_ВидыЗаписейЖурнала</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Шаг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_ЭлементыСхем</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_Задачи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаКого</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдКнопки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Итерация</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Процесс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_Процессы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Момент</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗаписи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/InformationRegisters/кбп_Маркеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>кбп_Маркеры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Шаг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_ЭлементыСхем</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.кбп_СостоянияМаркеров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РодительскийМаркер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ветка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Итерация</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВернутьНа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_ЭлементыСхем</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОжидаетсяВеток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПришлоВеток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Процесс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_Процессы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдМаркера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/InformationRegisters/кбп_ПереходыСхем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>кбп_ПереходыСхем</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Откуда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_ЭлементыСхем</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Куда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_ЭлементыСхем</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вариант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_ЭлементыСхем</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоВозврат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидУсловия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.кбп_ВидыУсловий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбработчикУсловия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_ОбработчикиПроцессов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдКнопки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Условие</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУсловия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_ВерсииСхем</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдПерехода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/Enums/кбп_СостоянияПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>кбп_СостоянияПроцессов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Активен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приостановлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прерван</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/Enums/кбп_ВидыЗаписейЖурнала.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>кбп_ВидыЗаписейЖурнала</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запуск</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗадачаСоздана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗадачаПринята</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗадачаВыполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НажатаКнопка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возврат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переадресация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комментарий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВложенныйЗапущен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВложенныйЗавершен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оповещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Предупреждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приостановка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продолжение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прерывание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеАдминистратором</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/Enums/кбп_СостоянияМаркеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>кбп_СостоянияМаркеров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Активен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ожидает</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/Enums/кбп_ВидыДействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>кбп_ВидыДействий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Переход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вернуть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переадресовать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработчик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОткрытьФорму</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапуститьВложенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прервать</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/Enums/кбп_СостоянияЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>кбп_СостоянияЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ожидает</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возвращена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переадресована</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/Enums/кбп_РежимыВозврата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>кбп_РежимыВозврата</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВернутьНаВернувшего</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПройтиМаршрутЗаново</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/Enums/кбп_ВидыУсловий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>кбп_ВидыУсловий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отбор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выражение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработчик</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/CommonModules/кбп_Движок/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Запускает процесс по текущей опубликованной версии схемы (Архитектура п. 6.1).
//
// Параметры:
//  Схема - СправочникСсылка.кбп_СхемыПроцессов
//  Предмет - ЛюбаяСсылка, Неопределено - объект, по которому идёт процесс.
//  Переменные - Соответствие, Структура, Неопределено - начальные значения переменных по имени.
//  Комментарий - Строка - комментарий автора при запуске.
//
// Возвращаемое значение:
//  СправочникСсылка.кбп_Процессы
//
Функция ЗапуститьПроцесс(Схема, Предмет = Неопределено, Переменные = Неопределено, Комментарий = "") Экспорт

	Если Не кбп_Лицензирование.ДоступноДействие("ЗапускПроцесса") Тогда
		ВызватьИсключение НСтр("ru = 'Запуск процессов недоступен по условиям лицензии.'");
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Схема) Тогда
		ВызватьИсключение НСтр("ru = 'Не указана схема процесса.'");
	КонецЕсли;
	Версия = Схема.ТекущаяВерсия;
	Если Не ЗначениеЗаполнено(Версия) Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'У схемы «%1» нет опубликованной версии.'"), Схема);
	КонецЕсли;
	ПроверитьПредмет(Схема, Предмет);

	Отказ = Ложь;
	кбп_ПроцессыПереопределяемый.ПередЗапускомПроцесса(Схема, Предмет, Переменные, Отказ);
	Если Отказ Тогда
		ВызватьИсключение НСтр("ru = 'Запуск процесса отменён.'");
	КонецЕсли;

	Старт = ШагСтарт(Версия);
	Автор = кбп_АдаптерКонфигурации.ТекущийПользователь();

	НачатьТранзакцию();
	Попытка
		Если Схема.ЗапретВторогоЭкземпляра И ЗначениеЗаполнено(Предмет) Тогда
			Блокировка = Новый БлокировкаДанных;
			Блокировка.Добавить("Справочник.кбп_СхемыПроцессов").УстановитьЗначение("Ссылка", Схема);
			Блокировка.Заблокировать();
			Если АктивныеПроцессыПредмета(Предмет, Схема).Количество() > 0 Тогда
				ВызватьИсключение СтрШаблон(
					НСтр("ru = 'По «%1» уже идёт процесс «%2». Второй экземпляр запрещён настройкой схемы.'"), Предмет, Схема);
			КонецЕсли;
		КонецЕсли;

		Ссылка = Справочники.кбп_Процессы.ПолучитьСсылку(Новый УникальныйИдентификатор);
		ЗаблокироватьПроцесс(Ссылка);

		ПроцессОбъект = Справочники.кбп_Процессы.СоздатьЭлемент();
		ПроцессОбъект.УстановитьСсылкуНового(Ссылка);
		ПроцессОбъект.Схема = Схема;
		ПроцессОбъект.ВерсияСхемы = Версия;
		ПроцессОбъект.Предмет = Предмет;
		ПроцессОбъект.ПредставлениеПредмета = Лев(ПредставлениеПредмета(Предмет), 255);
		ПроцессОбъект.Автор = Автор;
		ПроцессОбъект.Состояние = Перечисления.кбп_СостоянияПроцессов.Активен;
		ПроцессОбъект.ДатаСтарта = ТекущаяДатаСеанса();
		ПроцессОбъект.КорневойПроцесс = Ссылка;
		ПроцессОбъект.Наименование = Лев(НаименованиеПроцесса(Схема, Предмет), 150);
		ЗаполнитьПеременные(ПроцессОбъект, Схема, Переменные);
		ПроцессОбъект.Записать();

		Контекст = НовыйКонтекст(Ссылка);
		ЗаписатьВЖурнал(Контекст, Перечисления.кбп_ВидыЗаписейЖурнала.Запуск, Старт, , Комментарий);

		ИдМаркера = Строка(Новый УникальныйИдентификатор);
		ЗаписатьМаркер(Контекст, ИдМаркера, Старт, Перечисления.кбп_СостоянияМаркеров.Активен);
		ПродвинутьМаркер(Контекст, ИдМаркера, Старт, "");

		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

	кбп_Оповещения.ЗапуститьОтправку();
	Возврат Ссылка;

КонецФункции

// Выполняет задачу нажатием кнопки (Архитектура п. 6.2, 8.1).
//
// Параметры:
//  Задача - СправочникСсылка.кбп_Задачи
//  ИдКнопки - Строка - идентификатор кнопки из кбп_Действия.КнопкиЗадачи.
//  Комментарий - Строка
//
Процедура ВыполнитьЗадачу(Задача, ИдКнопки, Комментарий = "") Экспорт

	Процесс = Задача.Процесс;
	НачатьТранзакцию();
	Попытка
		ЗаблокироватьПроцесс(Процесс);
		ЗадачаОбъект = Задача.ПолучитьОбъект();
		Шаг = ЗадачаОбъект.Шаг;
		ПроверитьВыполнениеЗадачи(ЗадачаОбъект);

		Кнопка = кбп_Действия.НайтиКнопку(Шаг, ИдКнопки);
		Если Кнопка = Неопределено Тогда
			ВызватьИсключение СтрШаблон(НСтр("ru = 'У шага «%1» нет кнопки «%2».'"), Шаг, ИдКнопки);
		КонецЕсли;
		Если Кнопка.КомментарийОбязателен И Не ЗначениеЗаполнено(СокрЛП(Комментарий)) Тогда
			ВызватьИсключение СтрШаблон(НСтр("ru = 'Для действия «%1» нужен комментарий.'"), Кнопка.Заголовок);
		КонецЕсли;
		Действия = Перечисления.кбп_ВидыДействий;
		Если Кнопка.Действие = Действия.Вернуть Тогда
			ВызватьИсключение НСтр("ru = 'Для возврата на доработку выберите шаг возврата.'");
		КонецЕсли;

		Контекст = НовыйКонтекст(Процесс);
		Контекст.Задача = Задача;
		Контекст.ИдКнопки = ИдКнопки;
		Контекст.Комментарий = Комментарий;

		ЗадачаОбъект.Состояние = Перечисления.кбп_СостоянияЗадач.Выполнена;
		ЗадачаОбъект.Исполнитель = Контекст.Пользователь;
		ЗадачаОбъект.ДатаВыполнения = ТекущаяДатаСеанса();
		ЗадачаОбъект.Результат = ИдКнопки;
		ЗадачаОбъект.Комментарий = Комментарий;
		ЗадачаОбъект.Записать();

		ЗаписатьВЖурнал(Контекст, Перечисления.кбп_ВидыЗаписейЖурнала.ЗадачаВыполнена, Шаг, Задача, Комментарий,
			ИдКнопки, Кнопка.Заголовок, ЗадачаОбъект.Назначенный);

		Если Кнопка.Действие = Действия.Прервать Тогда
			ПрерватьВТранзакции(Контекст, Комментарий);
		Иначе
			Если Кнопка.Действие = Действия.Обработчик И ЗначениеЗаполнено(Кнопка.Обработчик) Тогда
				кбп_Действия.ВыполнитьОбработчик(Кнопка.Обработчик, Контекст);
				СохранитьПеременные(Контекст);
			КонецЕсли;
			ЗавершитьШагИПродвинуть(Контекст, ЗадачаОбъект, Кнопка);
		КонецЕсли;

		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

	кбп_Оповещения.ЗапуститьОтправку();

КонецПроцедуры

// Возвращает задачу на один из пройденных шагов (ФТ-404, Архитектура п. 6.4).
//
// Параметры:
//  Задача - СправочникСсылка.кбп_Задачи
//  ШагВозврата - СправочникСсылка.кбп_ЭлементыСхем - из ШагиДляВозврата.
//  Комментарий - Строка - обязателен.
//
Процедура ВернутьНаДоработку(Задача, ШагВозврата, Комментарий) Экспорт

	Если Не ЗначениеЗаполнено(СокрЛП(Комментарий)) Тогда
		ВызватьИсключение НСтр("ru = 'Укажите, что нужно доработать.'");
	КонецЕсли;
	Процесс = Задача.Процесс;

	НачатьТранзакцию();
	Попытка
		ЗаблокироватьПроцесс(Процесс);
		ЗадачаОбъект = Задача.ПолучитьОбъект();
		Шаг = ЗадачаОбъект.Шаг;
		ПроверитьВыполнениеЗадачи(ЗадачаОбъект);
		Если Не Шаг.РазрешенВозврат Тогда
			ВызватьИсключение СтрШаблон(НСтр("ru = 'На шаге «%1» возврат не разрешён.'"), Шаг);
		КонецЕсли;
		Если ШагиДляВозврата(Задача).НайтиПоЗначению(ШагВозврата) = Неопределено Тогда
			ВызватьИсключение СтрШаблон(НСтр("ru = 'Вернуть на шаг «%1» нельзя.'"), ШагВозврата);
		КонецЕсли;

		Контекст = НовыйКонтекст(Процесс);
		Контекст.Задача = Задача;
		Контекст.Комментарий = Комментарий;

		ЗадачаОбъект.Состояние = Перечисления.кбп_СостоянияЗадач.Возвращена;
		ЗадачаОбъект.Исполнитель = Контекст.Пользователь;
		ЗадачаОбъект.ДатаВыполнения = ТекущаяДатаСеанса();
		ЗадачаОбъект.Результат = кбп_Действия.ИдКнопкиВозврата();
		ЗадачаОбъект.Комментарий = Комментарий;
		ЗадачаОбъект.Записать();
		ОтменитьЗадачиМаркера(Контекст, ЗадачаОбъект.ИдМаркера, Задача, Перечисления.кбп_СостоянияЗадач.Возвращена);

		ЗаписатьВЖурнал(Контекст, Перечисления.кбп_ВидыЗаписейЖурнала.Возврат, Шаг, Задача, Комментарий,
			кбп_Действия.ИдКнопкиВозврата(), СтрШаблон(НСтр("ru = 'на шаг «%1»'"), ШагВозврата), ЗадачаОбъект.Назначенный);

		Маркер = ПрочитатьМаркер(Процесс, ЗадачаОбъект.ИдМаркера);
		Маркер.Итерация = Маркер.Итерация + 1;
		Если Шаг.РежимВозврата = Перечисления.кбп_РежимыВозврата.ВернутьНаВернувшего Тогда
			Маркер.ВернутьНа = Шаг;
		Иначе
			Маркер.ВернутьНа = Справочники.кбп_ЭлементыСхем.ПустаяСсылка();
		КонецЕсли;
		Маркер.Записать();

		Контекст.Возврат = Истина;
		ВойтиВШаг(Контекст, ЗадачаОбъект.ИдМаркера, ШагВозврата, "");

		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

	кбп_Оповещения.ЗапуститьОтправку();

КонецПроцедуры

// Шаги, на которые можно вернуть задачу: пройденные задачи процесса, пересечённые с настройкой шага.
//
// Параметры:
//  Задача - СправочникСсылка.кбп_Задачи
//
// Возвращаемое значение:
//  СписокЗначений - значение: СправочникСсылка.кбп_ЭлементыСхем, представление: наименование шага.
//
Функция ШагиДляВозврата(Задача) Экспорт

	Результат = Новый СписокЗначений;
	Шаг = Задача.Шаг;
	Если Не Шаг.РазрешенВозврат Тогда
		Возврат Результат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Процесс", Задача.Процесс);
	Запрос.УстановитьПараметр("Шаг", Шаг);
	Запрос.УстановитьПараметр("Выполненные", СостоянияВыполненных());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Задачи.Шаг КАК Шаг,
	|	МИНИМУМ(Задачи.ДатаСоздания) КАК ДатаСоздания
	|ИЗ
	|	Справочник.кбп_Задачи КАК Задачи
	|ГДЕ
	|	Задачи.Процесс = &Процесс
	|	И Задачи.Шаг <> &Шаг
	|	И Задачи.Состояние В (&Выполненные)
	|	И НЕ Задачи.ЭтоКопия
	|
	|СГРУППИРОВАТЬ ПО
	|	Задачи.Шаг
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаСоздания";
	Разрешенные = Шаг.ШагиВозврата.ВыгрузитьКолонку("Шаг");
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Разрешенные.Количество() = 0 Или Разрешенные.Найти(Выборка.Шаг) <> Неопределено Тогда
			Результат.Добавить(Выборка.Шаг, Строка(Выборка.Шаг));
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;

КонецФункции

// Отмечает задачу принятой к исполнению (ФТ-411). При «Взять в работу» снимает остальные задачи шага.
//
// Параметры:
//  Задача - СправочникСсылка.кбп_Задачи
//
Процедура ПринятьКИсполнению(Задача) Экспорт

	Процесс = Задача.Процесс;
	НачатьТранзакцию();
	Попытка
		ЗаблокироватьПроцесс(Процесс);
		ЗадачаОбъект = Задача.ПолучитьОбъект();
		ПроверитьВыполнениеЗадачи(ЗадачаОбъект);
		Если ЗадачаОбъект.ПринятаКИсполнению Тогда
			ОтменитьТранзакцию();
			Возврат;
		КонецЕсли;

		Контекст = НовыйКонтекст(Процесс);
		ЗадачаОбъект.ПринятаКИсполнению = Истина;
		ЗадачаОбъект.ПринялКИсполнению = Контекст.Пользователь;
		ЗадачаОбъект.ДатаПринятия = ТекущаяДатаСеанса();
		ЗадачаОбъект.Состояние = Перечисления.кбп_СостоянияЗадач.ВРаботе;
		ЗадачаОбъект.Записать();
		ЗаписатьВЖурнал(Контекст, Перечисления.кбп_ВидыЗаписейЖурнала.ЗадачаПринята, ЗадачаОбъект.Шаг, Задача, , , ,
			ЗадачаОбъект.Назначенный);

		Если ЗадачаОбъект.Шаг.ВзятьВРаботу Тогда
			ОтменитьЗадачиМаркера(Контекст, ЗадачаОбъект.ИдМаркера, Задача, Перечисления.кбп_СостоянияЗадач.Отменена);
		КонецЕсли;

		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

// Прерывает процесс: активные задачи отменяются, маркеры закрываются.
//
// Параметры:
//  Процесс - СправочникСсылка.кбп_Процессы
//  Комментарий - Строка
//
Процедура Прервать(Процесс, Комментарий) Экспорт

	НачатьТранзакцию();
	Попытка
		ЗаблокироватьПроцесс(Процесс);
		Контекст = НовыйКонтекст(Процесс);
		Если Не МожноУправлятьПроцессом(Процесс, Контекст.Пользователь) Тогда
			ВызватьИсключение НСтр("ru = 'Прервать процесс может его автор или администратор процессов.'");
		КонецЕсли;
		Если Не ПроцессАктивен(Процесс) Тогда
			ВызватьИсключение СтрШаблон(НСтр("ru = 'Процесс уже в состоянии «%1».'"), Процесс.Состояние);
		КонецЕсли;
		ПрерватьВТранзакции(Контекст, Комментарий);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

	кбп_Оповещения.ЗапуститьОтправку();

КонецПроцедуры

// Добавляет комментарий в ленту процесса (ФТ-405).
//
// Параметры:
//  Процесс - СправочникСсылка.кбп_Процессы
//  Текст - Строка
//  Задача - СправочникСсылка.кбп_Задачи, Неопределено
//
Процедура ДобавитьКомментарий(Процесс, Текст, Задача = Неопределено) Экспорт

	Если Не ЗначениеЗаполнено(СокрЛП(Текст)) Тогда
		Возврат;
	КонецЕсли;
	НачатьТранзакцию();
	Попытка
		ЗаблокироватьПроцесс(Процесс);
		Контекст = НовыйКонтекст(Процесс);
		Шаг = Неопределено;
		Если ЗначениеЗаполнено(Задача) Тогда
			Шаг = Задача.Шаг;
		КонецЕсли;
		ЗаписатьВЖурнал(Контекст, Перечисления.кбп_ВидыЗаписейЖурнала.Комментарий, Шаг, Задача, Текст);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

// Лента процесса: история и комментарии.
//
// Параметры:
//  Процесс - СправочникСсылка.кбп_Процессы
//
// Возвращаемое значение:
//  ТаблицаЗначений - Момент, Пользователь, ЗаКого, Событие, Шаг, Задача, Текст.
//
Функция ЖурналПроцесса(Процесс) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Процесс", Процесс);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Журнал.Момент КАК Момент,
	|	Журнал.НомерЗаписи КАК НомерЗаписи,
	|	Журнал.ВидЗаписи КАК ВидЗаписи,
	|	Журнал.Пользователь КАК Пользователь,
	|	Журнал.ЗаКого КАК ЗаКого,
	|	Журнал.Шаг КАК Шаг,
	|	Журнал.Задача КАК Задача,
	|	Журнал.Комментарий КАК Комментарий,
	|	Журнал.Данные КАК Данные
	|ИЗ
	|	РегистрСведений.кбп_ЖурналПроцессов КАК Журнал
	|ГДЕ
	|	Журнал.Процесс = &Процесс
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерЗаписи";
	Выборка = Запрос.Выполнить().Выбрать();

	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Момент");
	Результат.Колонки.Добавить("Пользователь");
	Результат.Колонки.Добавить("Событие");
	Результат.Колонки.Добавить("Шаг");
	Результат.Колонки.Добавить("Задача");
	Результат.Колонки.Добавить("Текст");
	Результат.Колонки.Добавить("ЭтоКомментарий");
	Пока Выборка.Следующий() Цикл
		СтрокаЖурнала = Результат.Добавить();
		СтрокаЖурнала.Момент = Выборка.Момент;
		СтрокаЖурнала.Пользователь = Строка(Выборка.Пользователь);
		Если ЗначениеЗаполнено(Выборка.ЗаКого) И Выборка.ЗаКого <> Выборка.Пользователь Тогда
			СтрокаЖурнала.Пользователь = СтрШаблон(НСтр("ru = '%1 (за %2)'"), Выборка.Пользователь, Выборка.ЗаКого);
		КонецЕсли;
		СтрокаЖурнала.Событие = Строка(Выборка.ВидЗаписи);
		СтрокаЖурнала.Шаг = Выборка.Шаг;
		СтрокаЖурнала.Задача = Выборка.Задача;
		СтрокаЖурнала.ЭтоКомментарий = (Выборка.ВидЗаписи = Перечисления.кбп_ВидыЗаписейЖурнала.Комментарий);
		Части = Новый Массив;
		Если ЗначениеЗаполнено(Выборка.Данные) Тогда
			Части.Добавить(Выборка.Данные);
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.Комментарий) Тогда
			Части.Добавить(Выборка.Комментарий);
		КонецЕсли;
		СтрокаЖурнала.Текст = СтрСоединить(Части, ": ");
	КонецЦикла;
	Возврат Результат;

КонецФункции

// Задачи процесса для формы процесса.
//
// Параметры:
//  Процесс - СправочникСсылка.кбп_Процессы
//
// Возвращаемое значение:
//  ТаблицаЗначений - Ссылка, Наименование, Назначенный, Исполнитель, Состояние, ДатаСоздания, Срок, ДатаВыполнения, Результат.
//
Функция ЗадачиПроцесса(Процесс) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Процесс", Процесс);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Задачи.Ссылка КАК Ссылка,
	|	Задачи.Наименование КАК Наименование,
	|	Задачи.Назначенный КАК Назначенный,
	|	Задачи.Исполнитель КАК Исполнитель,
	|	Задачи.Состояние КАК Состояние,
	|	Задачи.ДатаСоздания КАК ДатаСоздания,
	|	Задачи.Срок КАК Срок,
	|	Задачи.ДатаВыполнения КАК ДатаВыполнения,
	|	Задачи.Результат КАК Результат,
	|	Задачи.Шаг КАК Шаг
	|ИЗ
	|	Справочник.кбп_Задачи КАК Задачи
	|ГДЕ
	|	Задачи.Процесс = &Процесс
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаСоздания";
	Результат = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаТаблицы Из Результат Цикл
		СтрокаТаблицы.Результат = кбп_Действия.ЗаголовокКнопки(СтрокаТаблицы.Шаг, СтрокаТаблицы.Результат);
	КонецЦикла;
	Возврат Результат;

КонецФункции

// Активные задачи пользователя («Мои задачи»).
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи
//  ВключаяВыполненные - Булево - добавить выполненные за последние 30 дней.
//
// Возвращаемое значение:
//  ТаблицаЗначений - Ссылка, Наименование, Процесс, Схема, ПредставлениеПредмета, Предмет, Состояние, ДатаСоздания, Срок,
//                    Просрочена, Активна.
//
Функция ЗадачиПользователя(Пользователь, ВключаяВыполненные = Ложь) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("Активные", СостоянияАктивных());
	Запрос.УстановитьПараметр("ВключаяВыполненные", ВключаяВыполненные);
	Запрос.УстановитьПараметр("ДатаОтбора", ТекущаяДатаСеанса() - 30 * 86400);
	Запрос.УстановитьПараметр("Сейчас", ТекущаяДатаСеанса());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Задачи.Ссылка КАК Ссылка,
	|	Задачи.Наименование КАК Наименование,
	|	Задачи.Процесс КАК Процесс,
	|	Задачи.Процесс.Схема КАК Схема,
	|	Задачи.Предмет КАК Предмет,
	|	Задачи.ПредставлениеПредмета КАК ПредставлениеПредмета,
	|	Задачи.Состояние КАК Состояние,
	|	Задачи.ДатаСоздания КАК ДатаСоздания,
	|	Задачи.Срок КАК Срок,
	|	Задачи.Процесс.Автор КАК Автор,
	|	ВЫБОР
	|		КОГДА Задачи.Состояние В (&Активные)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Активна,
	|	ВЫБОР
	|		КОГДА Задачи.Состояние В (&Активные)
	|				И Задачи.Срок <> ДАТАВРЕМЯ(1, 1, 1)
	|				И Задачи.Срок < &Сейчас
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Просрочена
	|ИЗ
	|	Справочник.кбп_Задачи КАК Задачи
	|ГДЕ
	|	Задачи.Назначенный = &Пользователь
	|	И НЕ Задачи.ПометкаУдаления
	|	И (Задачи.Состояние В (&Активные)
	|			ИЛИ &ВключаяВыполненные
	|				И Задачи.ДатаВыполнения >= &ДатаОтбора)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Активна УБЫВ,
	|	ДатаСоздания УБЫВ";
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

// Процессы, запущенные пользователем.
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи
//
// Возвращаемое значение:
//  ТаблицаЗначений - Ссылка, Схема, ПредставлениеПредмета, Состояние, ДатаСтарта, ДатаЗавершения, ТекущиеШаги.
//
Функция ПроцессыАвтора(Пользователь) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Автор", Пользователь);
	Запрос.УстановитьПараметр("Активные", СостоянияАктивных());
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 500
	|	Процессы.Ссылка КАК Ссылка,
	|	Процессы.Схема КАК Схема,
	|	Процессы.ПредставлениеПредмета КАК ПредставлениеПредмета,
	|	Процессы.Состояние КАК Состояние,
	|	Процессы.ДатаСтарта КАК ДатаСтарта,
	|	Процессы.ДатаЗавершения КАК ДатаЗавершения
	|ПОМЕСТИТЬ ВТПроцессы
	|ИЗ
	|	Справочник.кбп_Процессы КАК Процессы
	|ГДЕ
	|	Процессы.Автор = &Автор
	|	И НЕ Процессы.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Процессы.ДатаСтарта УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТПроцессы.Ссылка КАК Ссылка,
	|	ВТПроцессы.Схема КАК Схема,
	|	ВТПроцессы.ПредставлениеПредмета КАК ПредставлениеПредмета,
	|	ВТПроцессы.Состояние КАК Состояние,
	|	ВТПроцессы.ДатаСтарта КАК ДатаСтарта,
	|	ВТПроцессы.ДатаЗавершения КАК ДатаЗавершения
	|ИЗ
	|	ВТПроцессы КАК ВТПроцессы
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаСтарта УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Задачи.Процесс КАК Процесс,
	|	Задачи.Наименование КАК Наименование,
	|	Задачи.Назначенный КАК Назначенный
	|ИЗ
	|	Справочник.кбп_Задачи КАК Задачи
	|ГДЕ
	|	Задачи.Процесс В
	|			(ВЫБРАТЬ
	|				ВТПроцессы.Ссылка
	|			ИЗ
	|				ВТПроцессы)
	|	И Задачи.Состояние В (&Активные)";
	Результаты = Запрос.ВыполнитьПакет();
	Результат = Результаты[1].Выгрузить();
	Результат.Колонки.Добавить("ТекущиеШаги", Новый ОписаниеТипов("Строка"));
	Результат.Индексы.Добавить("Ссылка");
	Выборка = Результаты[2].Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаПроцесса = Результат.Найти(Выборка.Процесс, "Ссылка");
		Если СтрокаПроцесса = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Текст = СтрШаблон("%1 (%2)", Выборка.Наименование, Выборка.Назначенный);
		СтрокаПроцесса.ТекущиеШаги = ?(ПустаяСтрока(СтрокаПроцесса.ТекущиеШаги), Текст, СтрокаПроцесса.ТекущиеШаги + "; " + Текст);
	КонецЦикла;
	Возврат Результат;

КонецФункции

// Активные процессы по предмету.
//
// Параметры:
//  Предмет - ЛюбаяСсылка
//  Схема - СправочникСсылка.кбп_СхемыПроцессов, Неопределено - отбор по схеме.
//
// Возвращаемое значение:
//  Массив из СправочникСсылка.кбп_Процессы
//
Функция АктивныеПроцессыПредмета(Предмет, Схема = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Предмет", Предмет);
	Запрос.УстановитьПараметр("Схема", Схема);
	Запрос.УстановитьПараметр("БезОтбораПоСхеме", Не ЗначениеЗаполнено(Схема));
	Запрос.УстановитьПараметр("Активные", СостоянияАктивныхПроцессов());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Процессы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.кбп_Процессы КАК Процессы
	|ГДЕ
	|	Процессы.Предмет = &Предмет
	|	И Процессы.Состояние В (&Активные)
	|	И (&БезОтбораПоСхеме
	|			ИЛИ Процессы.Схема = &Схема)";
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

КонецФункции

// Может ли текущий пользователь выполнить задачу (назначенный или администратор процессов).
//
// Параметры:
//  Задача - СправочникСсылка.кбп_Задачи, СправочникОбъект.кбп_Задачи
//
// Возвращаемое значение:
//  Булево
//
Функция МожноВыполнитьЗадачу(Задача) Экспорт

	Если Задача.ЭтоКопия Тогда
		Возврат Ложь;
	КонецЕсли;
	Если СостоянияАктивных().Найти(Задача.Состояние) = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	Если Задача.Процесс.Состояние <> Перечисления.кбп_СостоянияПроцессов.Активен Тогда
		Возврат Ложь;
	КонецЕсли;
	Пользователь = кбп_АдаптерКонфигурации.ТекущийПользователь();
	Возврат Задача.Назначенный = Пользователь Или кбп_АдаптерКонфигурации.ЭтоАдминистраторПроцессов();

КонецФункции

// Может ли пользователь прервать процесс (автор или администратор процессов).
//
// Параметры:
//  Процесс - СправочникСсылка.кбп_Процессы
//  Пользователь - СправочникСсылка.Пользователи, Неопределено - текущий.
//
// Возвращаемое значение:
//  Булево
//
Функция МожноУправлятьПроцессом(Процесс, Пользователь = Неопределено) Экспорт

	Если Пользователь = Неопределено Тогда
		Пользователь = кбп_АдаптерКонфигурации.ТекущийПользователь();
	КонецЕсли;
	Возврат Процесс.Автор = Пользователь Или кбп_АдаптерКонфигурации.ЭтоАдминистраторПроцессов();

КонецФункции

// Состояние шагов процесса для подсветки схемы (ФТ-110).
//
// Параметры:
//  Процесс - СправочникСсылка.кбп_Процессы
//
// Возвращаемое значение:
//  Соответствие - ИдЭлемента шага → "Пройденный" или "Текущий".
//
Функция СостоянияШаговПроцесса(Процесс) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Процесс", Процесс);
	Запрос.УстановитьПараметр("Завершен", Перечисления.кбп_СостоянияМаркеров.Завершен);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Журнал.Шаг.ИдЭлемента КАК ИдЭлемента
	|ИЗ
	|	РегистрСведений.кбп_ЖурналПроцессов КАК Журнал
	|ГДЕ
	|	Журнал.Процесс = &Процесс
	|	И Журнал.Шаг <> ЗНАЧЕНИЕ(Справочник.кбп_ЭлементыСхем.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Маркеры.Шаг.ИдЭлемента КАК ИдЭлемента
	|ИЗ
	|	РегистрСведений.кбп_Маркеры КАК Маркеры
	|ГДЕ
	|	Маркеры.Процесс = &Процесс
	|	И Маркеры.Состояние <> &Завершен";
	Результаты = Запрос.ВыполнитьПакет();
	Состояния = Новый Соответствие;
	Выборка = Результаты[0].Выбрать();
	Пока Выборка.Следующий() Цикл
		Состояния.Вставить(Выборка.ИдЭлемента, "Пройденный");
	КонецЦикла;
	Выборка = Результаты[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		Состояния.Вставить(Выборка.ИдЭлемента, "Текущий");
	КонецЦикла;
	Возврат Состояния;

КонецФункции

// Состояния задач, в которых задачу можно выполнить.
//
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.кбп_СостоянияЗадач
//
Функция СостоянияАктивных() Экспорт

	Состояния = Новый Массив;
	Состояния.Добавить(Перечисления.кбп_СостоянияЗадач.Ожидает);
	Состояния.Добавить(Перечисления.кбп_СостоянияЗадач.ВРаботе);
	Возврат Состояния;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Маршрут

// Выбирает переход из шага и входит в следующий шаг (Архитектура п. 6.2).
Процедура ПродвинутьМаркер(Контекст, ИдМаркера, Шаг, ИдКнопки)

	Переход = ВыбратьПереход(Контекст, Шаг, ИдКнопки);
	ЗаписатьВЖурнал(Контекст, Перечисления.кбп_ВидыЗаписейЖурнала.Переход, Переход.Куда, , , ИдКнопки,
		СтрШаблон("%1 → %2", Шаг, Переход.Куда));
	ВойтиВШаг(Контекст, ИдМаркера, Переход.Куда, ИдКнопки);

КонецПроцедуры

Процедура ВойтиВШаг(Контекст, ИдМаркера, Шаг, ИдКнопки)

	Контекст.Переходов = Контекст.Переходов + 1;
	Если Контекст.Переходов > 1000 Тогда
		ВызватьИсключение НСтр("ru = 'Схема зациклилась: больше 1000 автоматических переходов без задач.'");
	КонецЕсли;

	Типы = Перечисления.кбп_ТипыШагов;
	ТипШага = Шаг.ТипШага;
	Если ТипШага = Типы.Задача Тогда
		ЗаписатьМаркер(Контекст, ИдМаркера, Шаг, Перечисления.кбп_СостоянияМаркеров.Ожидает);
		СоздатьЗадачи(Контекст, ИдМаркера, Шаг);

	ИначеЕсли ТипШага = Типы.Условие Тогда
		ЗаписатьМаркер(Контекст, ИдМаркера, Шаг, Перечисления.кбп_СостоянияМаркеров.Активен);
		ПродвинутьМаркер(Контекст, ИдМаркера, Шаг, ИдКнопки);

	ИначеЕсли ТипШага = Типы.Обработка Тогда
		ЗаписатьМаркер(Контекст, ИдМаркера, Шаг, Перечисления.кбп_СостоянияМаркеров.Активен);
		Если ЗначениеЗаполнено(Шаг.Обработчик) Тогда
			кбп_Действия.ВыполнитьОбработчик(Шаг.Обработчик, Контекст);
			СохранитьПеременные(Контекст);
		КонецЕсли;
		ПродвинутьМаркер(Контекст, ИдМаркера, Шаг, ИдКнопки);

	ИначеЕсли ТипШага = Типы.Завершение Тогда
		ЗаписатьМаркер(Контекст, ИдМаркера, Шаг, Перечисления.кбп_СостоянияМаркеров.Завершен);
		Если Не ЕстьАктивныеМаркеры(Контекст.Процесс) Тогда
			ЗавершитьПроцесс(Контекст, Шаг);
		КонецЕсли;

	Иначе
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Шаг «%1» типа «%2» будет поддерживаться со следующего этапа (маршруты). Сейчас доступны Старт, Задача, Условие, Обработка, Завершение.'"),
			Шаг, ТипШага);
	КонецЕсли;

КонецПроцедуры

// Переход по кнопке, по условию или «по умолчанию».
Функция ВыбратьПереход(Контекст, Шаг, ИдКнопки)

	Выходы = ВыходыШага(Шаг);
	Если Выходы.Количество() = 0 Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Из шага «%1» нет исходящих линий.'"), Шаг);
	КонецЕсли;
	Если Выходы.Количество() = 1 И Шаг.ТипШага <> Перечисления.кбп_ТипыШагов.Условие Тогда
		Возврат Выходы[0];
	КонецЕсли;

	ВидыУсловий = Перечисления.кбп_ВидыУсловий;
	Если ЗначениеЗаполнено(ИдКнопки) Тогда
		ПереходКнопки = кбп_Действия.ПереходКнопки(Шаг, ИдКнопки);
		Для Каждого Выход Из Выходы Цикл
			Если Выход.ИдПерехода = ИдКнопки Или Выход.ИдКнопки = ИдКнопки
				Или ЗначениеЗаполнено(ПереходКнопки) И Выход.ИдПерехода = ПереходКнопки Тогда
				Возврат Выход;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Для Каждого Выход Из Выходы Цикл
		Если Выход.ВидУсловия = ВидыУсловий.Обработчик Тогда
			Если кбп_Условия.УсловиеВыполняется(Выход.ОбработчикУсловия, Контекст) Тогда
				Возврат Выход;
			КонецЕсли;
		ИначеЕсли Выход.ВидУсловия = ВидыУсловий.Отбор Или Выход.ВидУсловия = ВидыУсловий.Выражение Тогда
			ВызватьИсключение СтрШаблон(
				НСтр("ru = 'Условие вида «%1» на линии «%2» будет поддерживаться со следующего этапа.'"),
				Выход.ВидУсловия, Выход.Наименование);
		КонецЕсли;
	КонецЦикла;

	Для Каждого Выход Из Выходы Цикл
		Если Выход.ПоУмолчанию Тогда
			Возврат Выход;
		КонецЕсли;
	КонецЦикла;

	ВызватьИсключение СтрШаблон(
		НСтр("ru = 'Не удалось выбрать ветку после шага «%1» (кнопка «%2»): нет подходящей линии и линии «По умолчанию».'"),
		Шаг, ИдКнопки);

КонецФункции

// Исходящие линии шага по порядку.
//
// Параметры:
//  Шаг - СправочникСсылка.кбп_ЭлементыСхем
//
// Возвращаемое значение:
//  ТаблицаЗначений - ИдПерехода, Куда, Наименование, ПоУмолчанию, ВидУсловия, ОбработчикУсловия, ИдКнопки, Порядок.
//
Функция ВыходыШага(Шаг) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Шаг", Шаг);
	Запрос.УстановитьПараметр("Версия", Шаг.Владелец);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Переходы.ИдПерехода КАК ИдПерехода,
	|	Переходы.Куда КАК Куда,
	|	Переходы.Наименование КАК Наименование,
	|	Переходы.ПоУмолчанию КАК ПоУмолчанию,
	|	Переходы.ВидУсловия КАК ВидУсловия,
	|	Переходы.ОбработчикУсловия КАК ОбработчикУсловия,
	|	Переходы.ИдКнопки КАК ИдКнопки,
	|	Переходы.Порядок КАК Порядок
	|ИЗ
	|	РегистрСведений.кбп_ПереходыСхем КАК Переходы
	|ГДЕ
	|	Переходы.Версия = &Версия
	|	И (Переходы.Откуда = &Шаг
	|			ИЛИ Переходы.Вариант = &Шаг)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок";
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Функция ШагСтарт(Версия)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Версия", Версия);
	Запрос.УстановитьПараметр("Старт", Перечисления.кбп_ТипыШагов.Старт);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Элементы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.кбп_ЭлементыСхем КАК Элементы
	|ГДЕ
	|	Элементы.Владелец = &Версия
	|	И Элементы.ТипШага = &Старт
	|	И НЕ Элементы.ПометкаУдаления
	|	И НЕ Элементы.НетНаСхеме";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'В версии «%1» нет шага Старт.'"), Версия);
	КонецЕсли;
	Возврат Выборка.Ссылка;

КонецФункции

// Выполненная задача завершает шаг: «каждому» — после всех задач (или сразу по кнопке вида «Опасная»),
// «любому из» — сразу; остальные задачи шага отменяются.
Процедура ЗавершитьШагИПродвинуть(Контекст, ЗадачаОбъект, Кнопка)

	ИдМаркера = ЗадачаОбъект.ИдМаркера;
	Шаг = ЗадачаОбъект.Шаг;
	Каждому = (Шаг.РежимНазначения <> Перечисления.кбп_РежимыНазначения.ЛюбомуИз);
	Если Каждому И Кнопка.Вид <> Перечисления.кбп_ВидыКнопок.Опасная
		И ОставшиесяЗадачиМаркера(Контекст.Процесс, ИдМаркера, ЗадачаОбъект.Ссылка).Количество() > 0 Тогда
		Возврат; // ждём остальных исполнителей
	КонецЕсли;
	ОтменитьЗадачиМаркера(Контекст, ИдМаркера, ЗадачаОбъект.Ссылка, Перечисления.кбп_СостоянияЗадач.Отменена);

	Маркер = ПрочитатьМаркер(Контекст.Процесс, ИдМаркера);
	ВернутьНа = Маркер.ВернутьНа;
	Если ЗначениеЗаполнено(ВернутьНа) Тогда
		// После доработки — сразу на вернувший шаг (режим «Вернуть на вернувший шаг»).
		Маркер.ВернутьНа = Справочники.кбп_ЭлементыСхем.ПустаяСсылка();
		Маркер.Записать();
		ЗаписатьВЖурнал(Контекст, Перечисления.кбп_ВидыЗаписейЖурнала.Переход, ВернутьНа, , , Кнопка.ИдКнопки,
			СтрШаблон(НСтр("ru = '%1 → %2 (после доработки)'"), Шаг, ВернутьНа));
		ВойтиВШаг(Контекст, ИдМаркера, ВернутьНа, Кнопка.ИдКнопки);
	Иначе
		ПродвинутьМаркер(Контекст, ИдМаркера, Шаг, Кнопка.ИдКнопки);
	КонецЕсли;

КонецПроцедуры

Процедура ЗавершитьПроцесс(Контекст, Шаг)

	ПроцессОбъект = Контекст.Процесс.ПолучитьОбъект();
	ПроцессОбъект.Состояние = Перечисления.кбп_СостоянияПроцессов.Завершен;
	ПроцессОбъект.ДатаЗавершения = ТекущаяДатаСеанса();
	ПроцессОбъект.Записать();
	ЗаписатьВЖурнал(Контекст, Перечисления.кбп_ВидыЗаписейЖурнала.Завершение, Шаг);
	кбп_Оповещения.ОповеститьОПроцессе(Контекст.Процесс, Перечисления.кбп_СобытияПроцессов.ПроцессЗавершен);
	кбп_ПроцессыПереопределяемый.ПриЗавершенииПроцесса(Контекст.Процесс);

КонецПроцедуры

Процедура ПрерватьВТранзакции(Контекст, Комментарий)

	Процесс = Контекст.Процесс;
	Для Каждого Задача Из АктивныеЗадачиПроцесса(Процесс) Цикл
		ЗадачаОбъект = Задача.ПолучитьОбъект();
		ЗадачаОбъект.Состояние = Перечисления.кбп_СостоянияЗадач.Отменена;
		ЗадачаОбъект.Записать();
	КонецЦикла;

	Набор = РегистрыСведений.кбп_Маркеры.СоздатьНаборЗаписей();
	Набор.Отбор.Процесс.Установить(Процесс);
	Набор.Прочитать();
	Для Каждого Запись Из Набор Цикл
		Запись.Состояние = Перечисления.кбп_СостоянияМаркеров.Завершен;
	КонецЦикла;
	Набор.Записать();

	ПроцессОбъект = Процесс.ПолучитьОбъект();
	ПроцессОбъект.Состояние = Перечисления.кбп_СостоянияПроцессов.Прерван;
	ПроцессОбъект.ДатаЗавершения = ТекущаяДатаСеанса();
	ПроцессОбъект.Записать();
	ЗаписатьВЖурнал(Контекст, Перечисления.кбп_ВидыЗаписейЖурнала.Прерывание, , , Комментарий);
	кбп_Оповещения.ОповеститьОПроцессе(Процесс, Перечисления.кбп_СобытияПроцессов.ПроцессПрерван);

КонецПроцедуры

#КонецОбласти

#Область Задачи

Процедура СоздатьЗадачи(Контекст, ИдМаркера, Шаг)

	Маркер = ПрочитатьМаркер(Контекст.Процесс, ИдМаркера);
	Исполнители = Неопределено;
	Если Контекст.Возврат И Шаг.ТотЖеИсполнительПриВозврате Тогда
		Исполнители = ПрежниеИсполнителиШага(Контекст.Процесс, Шаг);
	КонецЕсли;
	Если Исполнители = Неопределено Или Исполнители.Количество() = 0 Тогда
		Исполнители = кбп_Адресация.ОпределитьИсполнителей(Шаг, Контекст);
	КонецЕсли;
	Если Исполнители.Количество() = 0 Тогда
		Администратор = кбп_ПроцессыСлужебный.Настройка("АдминистраторПроцессов");
		Получатель = ?(ЗначениеЗаполнено(Администратор), Администратор, Контекст.Автор);
		Исполнители.Добавить(кбп_Адресация.НовыйИсполнитель(Получатель));
		ЗаписатьВЖурнал(Контекст, Перечисления.кбп_ВидыЗаписейЖурнала.Предупреждение, Шаг, , ,
			, СтрШаблон(НСтр("ru = 'Не найдены исполнители шага «%1», задача назначена: %2'"), Шаг, Получатель));
	КонецЕсли;

	Срок = СрокЗадачи(Шаг, Контекст);
	Для Каждого Исполнитель Из Исполнители Цикл
		ЗадачаОбъект = Справочники.кбп_Задачи.СоздатьЭлемент();
		ЗадачаОбъект.Наименование = Лев(Строка(Шаг), 150);
		ЗадачаОбъект.Процесс = Контекст.Процесс;
		ЗадачаОбъект.Шаг = Шаг;
		ЗадачаОбъект.ИдМаркера = ИдМаркера;
		ЗадачаОбъект.Состояние = Перечисления.кбп_СостоянияЗадач.Ожидает;
		ЗадачаОбъект.Назначенный = Исполнитель.Пользователь;
		ЗадачаОбъект.Роль = Исполнитель.Роль;
		ЗадачаОбъект.ОбъектАдресации1 = Исполнитель.ОбъектАдресации1;
		ЗадачаОбъект.ОбъектАдресации2 = Исполнитель.ОбъектАдресации2;
		ЗадачаОбъект.ДатаСоздания = ТекущаяДатаСеанса();
		ЗадачаОбъект.Срок = Срок;
		ЗадачаОбъект.Итерация = Маркер.Итерация;
		ЗадачаОбъект.Предмет = Контекст.Предмет;
		ЗадачаОбъект.ПредставлениеПредмета = Лев(ПредставлениеПредмета(Контекст.Предмет), 255);
		ЗадачаОбъект.Записать();

		ЗаписатьВЖурнал(Контекст, Перечисления.кбп_ВидыЗаписейЖурнала.ЗадачаСоздана, Шаг, ЗадачаОбъект.Ссылка, , ,
			СтрШаблон(НСтр("ru = 'исполнитель: %1'"), Исполнитель.Пользователь));
		кбп_Оповещения.ОповеститьОЗадаче(ЗадачаОбъект.Ссылка, Перечисления.кбп_СобытияПроцессов.ЗадачаНазначена);
	КонецЦикла;

КонецПроцедуры

Функция СрокЗадачи(Шаг, Контекст)

	Если ЗначениеЗаполнено(Шаг.СрокИзПеременной) Тогда
		Значение = Контекст.Переменные[Шаг.СрокИзПеременной.Имя];
		Возврат ?(ТипЗнч(Значение) = Тип("Дата"), Значение, Дата(1, 1, 1));
	КонецЕсли;
	Если Шаг.СрокЗначение = 0 Тогда
		Возврат Дата(1, 1, 1);
	КонецЕсли;

	Сейчас = ТекущаяДатаСеанса();
	Единицы = Перечисления.кбп_ЕдиницыСрока;
	Если Шаг.СрокЕдиница = Единицы.Минуты Тогда
		Возврат Сейчас + Шаг.СрокЗначение * 60;
	ИначеЕсли Шаг.СрокЕдиница = Единицы.Часы Тогда
		Возврат Сейчас + Шаг.СрокЗначение * 3600;
	ИначеЕсли Шаг.СрокЕдиница = Единицы.РабочиеЧасы Тогда
		Возврат кбп_АдаптерКонфигурации.ДобавитьРабочиеЧасы(Сейчас, Шаг.СрокЗначение);
	ИначеЕсли Шаг.СрокЕдиница = Единицы.РабочиеДни Тогда
		Возврат кбп_АдаптерКонфигурации.ДобавитьРабочиеДни(Сейчас, Шаг.СрокЗначение);
	КонецЕсли;
	Возврат Сейчас + Шаг.СрокЗначение * 86400;

КонецФункции

Процедура ПроверитьВыполнениеЗадачи(ЗадачаОбъект)

	Если ЗадачаОбъект.ЭтоКопия Тогда
		ВызватьИсключение НСтр("ru = 'Это копия задачи для сведения, её не выполняют.'");
	КонецЕсли;
	Если СостоянияАктивных().Найти(ЗадачаОбъект.Состояние) = Неопределено Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Задача уже в состоянии «%1».'"), ЗадачаОбъект.Состояние);
	КонецЕсли;
	Если ЗадачаОбъект.Процесс.Состояние <> Перечисления.кбп_СостоянияПроцессов.Активен Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Процесс в состоянии «%1».'"), ЗадачаОбъект.Процесс.Состояние);
	КонецЕсли;
	Пользователь = кбп_АдаптерКонфигурации.ТекущийПользователь();
	Если ЗадачаОбъект.Назначенный <> Пользователь И Не кбп_АдаптерКонфигурации.ЭтоАдминистраторПроцессов() Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Задача назначена пользователю %1.'"), ЗадачаОбъект.Назначенный);
	КонецЕсли;

КонецПроцедуры

Функция ОставшиесяЗадачиМаркера(Процесс, ИдМаркера, Кроме)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Процесс", Процесс);
	Запрос.УстановитьПараметр("ИдМаркера", ИдМаркера);
	Запрос.УстановитьПараметр("Кроме", Кроме);
	Запрос.УстановитьПараметр("Активные", СостоянияАктивных());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Задачи.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.кбп_Задачи КАК Задачи
	|ГДЕ
	|	Задачи.Процесс = &Процесс
	|	И Задачи.ИдМаркера = &ИдМаркера
	|	И Задачи.Ссылка <> &Кроме
	|	И Задачи.Состояние В (&Активные)
	|	И НЕ Задачи.ЭтоКопия";
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

КонецФункции

Процедура ОтменитьЗадачиМаркера(Контекст, ИдМаркера, Кроме, Состояние)

	Для Каждого Задача Из ОставшиесяЗадачиМаркера(Контекст.Процесс, ИдМаркера, Кроме) Цикл
		ЗадачаОбъект = Задача.ПолучитьОбъект();
		ЗадачаОбъект.Состояние = Состояние;
		ЗадачаОбъект.Записать();
	КонецЦикла;

КонецПроцедуры

Функция АктивныеЗадачиПроцесса(Процесс)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Процесс", Процесс);
	Запрос.УстановитьПараметр("Активные", СостоянияАктивных());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Задачи.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.кбп_Задачи КАК Задачи
	|ГДЕ
	|	Задачи.Процесс = &Процесс
	|	И Задачи.Состояние В (&Активные)";
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

КонецФункции

// Исполнители последней итерации шага — для возврата «тому же исполнителю» (Архитектура п. 6.4, шаг 4).
Функция ПрежниеИсполнителиШага(Процесс, Шаг)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Процесс", Процесс);
	Запрос.УстановитьПараметр("Шаг", Шаг);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МАКСИМУМ(Задачи.Итерация) КАК Итерация
	|ПОМЕСТИТЬ ВТИтерация
	|ИЗ
	|	Справочник.кбп_Задачи КАК Задачи
	|ГДЕ
	|	Задачи.Процесс = &Процесс
	|	И Задачи.Шаг = &Шаг
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Задачи.Назначенный КАК Пользователь,
	|	Задачи.Роль КАК Роль,
	|	Задачи.ОбъектАдресации1 КАК ОбъектАдресации1,
	|	Задачи.ОбъектАдресации2 КАК ОбъектАдресации2
	|ИЗ
	|	Справочник.кбп_Задачи КАК Задачи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТИтерация КАК ВТИтерация
	|		ПО Задачи.Итерация = ВТИтерация.Итерация
	|ГДЕ
	|	Задачи.Процесс = &Процесс
	|	И Задачи.Шаг = &Шаг
	|	И НЕ Задачи.ЭтоКопия";
	Результат = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Исполнитель = кбп_Адресация.НовыйИсполнитель(Выборка.Пользователь);
		ЗаполнитьЗначенияСвойств(Исполнитель, Выборка, "Роль, ОбъектАдресации1, ОбъектАдресации2");
		Результат.Добавить(Исполнитель);
	КонецЦикла;
	Возврат Результат;

КонецФункции

Функция СостоянияВыполненных()

	Состояния = Новый Массив;
	Состояния.Добавить(Перечисления.кбп_СостоянияЗадач.Выполнена);
	Возврат Состояния;

КонецФункции

Функция СостоянияАктивныхПроцессов()

	Состояния = Новый Массив;
	Состояния.Добавить(Перечисления.кбп_СостоянияПроцессов.Активен);
	Состояния.Добавить(Перечисления.кбп_СостоянияПроцессов.Приостановлен);
	Состояния.Добавить(Перечисления.кбп_СостоянияПроцессов.Ошибка);
	Возврат Состояния;

КонецФункции

#КонецОбласти

#Область Маркеры

Процедура ЗаблокироватьПроцесс(Процесс)

	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.кбп_Маркеры");
	ЭлементБлокировки.УстановитьЗначение("Процесс", Процесс);
	Блокировка.Заблокировать();

КонецПроцедуры

Процедура ЗаписатьМаркер(Контекст, ИдМаркера, Шаг, Состояние)

	Маркер = ПрочитатьМаркер(Контекст.Процесс, ИдМаркера);
	Если Не Маркер.Выбран() Тогда
		Маркер.Процесс = Контекст.Процесс;
		Маркер.ИдМаркера = ИдМаркера;
		Маркер.ДатаСоздания = ТекущаяДатаСеанса();
	КонецЕсли;
	Маркер.Шаг = Шаг;
	Маркер.Состояние = Состояние;
	Маркер.Записать();

КонецПроцедуры

Функция ПрочитатьМаркер(Процесс, ИдМаркера)

	Маркер = РегистрыСведений.кбп_Маркеры.СоздатьМенеджерЗаписи();
	Маркер.Процесс = Процесс;
	Маркер.ИдМаркера = ИдМаркера;
	Маркер.Прочитать();
	Если Не Маркер.Выбран() Тогда
		Маркер.Процесс = Процесс;
		Маркер.ИдМаркера = ИдМаркера;
	КонецЕсли;
	Возврат Маркер;

КонецФункции

Функция ЕстьАктивныеМаркеры(Процесс)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Процесс", Процесс);
	Запрос.УстановитьПараметр("Завершен", Перечисления.кбп_СостоянияМаркеров.Завершен);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Маркеры.ИдМаркера КАК ИдМаркера
	|ИЗ
	|	РегистрСведений.кбп_Маркеры КАК Маркеры
	|ГДЕ
	|	Маркеры.Процесс = &Процесс
	|	И Маркеры.Состояние <> &Завершен";
	Возврат Не Запрос.Выполнить().Пустой();

КонецФункции

Функция ПроцессАктивен(Процесс)
	Возврат СостоянияАктивныхПроцессов().Найти(Процесс.Состояние) <> Неопределено;
КонецФункции

#КонецОбласти

#Область Контекст

// Контекст операции над процессом: передаётся в адресацию, условия и обработчики (Архитектура п. 8.3).
Функция НовыйКонтекст(Процесс)

	Контекст = Новый Структура;
	Контекст.Вставить("Процесс", Процесс);
	Контекст.Вставить("Схема", Процесс.Схема);
	Контекст.Вставить("Версия", Процесс.ВерсияСхемы);
	Контекст.Вставить("Предмет", Процесс.Предмет);
	Контекст.Вставить("Автор", Процесс.Автор);
	Контекст.Вставить("Пользователь", кбп_АдаптерКонфигурации.ТекущийПользователь());
	Контекст.Вставить("Задача", Неопределено);
	Контекст.Вставить("ИдКнопки", "");
	Контекст.Вставить("Комментарий", "");
	Контекст.Вставить("Переменные", ПеременныеПроцесса(Процесс));
	Контекст.Вставить("ПеременныеИзменены", Ложь);
	Контекст.Вставить("Возврат", Ложь);
	Контекст.Вставить("Переходов", 0);
	Контекст.Вставить("НомерЖурнала", ПоследнийНомерЖурнала(Процесс));
	Возврат Контекст;

КонецФункции

// Соответствие «имя переменной → значение».
Функция ПеременныеПроцесса(Процесс)

	Результат = Новый Соответствие;
	Для Каждого СтрокаТаблицы Из Процесс.Переменные Цикл
		Результат.Вставить(СтрокаТаблицы.Переменная.Имя, СтрокаТаблицы.Значение);
	КонецЦикла;
	Возврат Результат;

КонецФункции

Процедура СохранитьПеременные(Контекст)

	Если Не Контекст.ПеременныеИзменены Тогда
		Возврат;
	КонецЕсли;
	ПроцессОбъект = Контекст.Процесс.ПолучитьОбъект();
	Для Каждого СтрокаТаблицы Из ПроцессОбъект.Переменные Цикл
		Значение = Контекст.Переменные[СтрокаТаблицы.Переменная.Имя];
		Если Значение <> Неопределено Тогда
			СтрокаТаблицы.Значение = Значение;
		КонецЕсли;
	КонецЦикла;
	ПроцессОбъект.Записать();
	Контекст.ПеременныеИзменены = Ложь;

КонецПроцедуры

Процедура ЗаполнитьПеременные(ПроцессОбъект, Схема, Значения)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Схема", Схема);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Переменные.Ссылка КАК Ссылка,
	|	Переменные.Имя КАК Имя
	|ИЗ
	|	ПланВидовХарактеристик.кбп_ПеременныеПроцессов КАК Переменные
	|ГДЕ
	|	Переменные.Схема = &Схема
	|	И НЕ Переменные.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Переменные.Порядок";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаТаблицы = ПроцессОбъект.Переменные.Добавить();
		СтрокаТаблицы.Переменная = Выборка.Ссылка;
		Значение = Неопределено;
		Если Значения <> Неопределено Тогда
			Если ТипЗнч(Значения) = Тип("Структура") Тогда
				Значения.Свойство(Выборка.Имя, Значение);
			Иначе
				Значение = Значения[Выборка.Имя];
			КонецЕсли;
		КонецЕсли;
		Если Значение = Неопределено Тогда
			Значение = Выборка.Ссылка.ЗначениеПоУмолчанию.Получить();
		КонецЕсли;
		СтрокаТаблицы.Значение = Выборка.Ссылка.ТипЗначения.ПривестиЗначение(Значение);
	КонецЦикла;

КонецПроцедуры

Процедура ПроверитьПредмет(Схема, Предмет)

	ТипПредмета = Схема.ТипПредмета;
	Если Не ЗначениеЗаполнено(ТипПредмета) Тогда
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Предмет) Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Для схемы «%1» укажите предмет процесса (%2).'"), Схема, ТипПредмета);
	КонецЕсли;
	МетаданныеПредмета = Метаданные.НайтиПоТипу(ТипЗнч(Предмет));
	Если МетаданныеПредмета = Неопределено Или МетаданныеПредмета.ПолноеИмя() <> ТипПредмета Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Предмет процесса «%1» должен иметь тип %2.'"), Предмет, ТипПредмета);
	КонецЕсли;

КонецПроцедуры

Функция ПредставлениеПредмета(Предмет)

	Если Не ЗначениеЗаполнено(Предмет) Тогда
		Возврат "";
	КонецЕсли;
	Возврат кбп_АдаптерКонфигурации.ПредставлениеОбъекта(Предмет);

КонецФункции

Функция НаименованиеПроцесса(Схема, Предмет)

	Если ЗначениеЗаполнено(Предмет) Тогда
		Возврат СтрШаблон("%1: %2", Схема, ПредставлениеПредмета(Предмет));
	КонецЕсли;
	Возврат СтрШаблон("%1 от %2", Схема, Формат(ТекущаяДатаСеанса(), "ДЛФ=DT"));

КонецФункции

#КонецОбласти

#Область Журнал

Процедура ЗаписатьВЖурнал(Контекст, ВидЗаписи, Шаг = Неопределено, Задача = Неопределено, Комментарий = "",
	ИдКнопки = "", Данные = "", ЗаКого = Неопределено)

	Контекст.НомерЖурнала = Контекст.НомерЖурнала + 1;
	Запись = РегистрыСведений.кбп_ЖурналПроцессов.СоздатьМенеджерЗаписи();
	Запись.Процесс = Контекст.Процесс;
	Запись.Момент = ТекущаяДатаСеанса();
	Запись.НомерЗаписи = Контекст.НомерЖурнала;
	Запись.ВидЗаписи = ВидЗаписи;
	Если Шаг <> Неопределено Тогда
		Запись.Шаг = Шаг;
	КонецЕсли;
	Если Задача <> Неопределено Тогда
		Запись.Задача = Задача;
	КонецЕсли;
	Запись.Пользователь = Контекст.Пользователь;
	Если ЗаКого <> Неопределено И ЗаКого <> Контекст.Пользователь Тогда
		Запись.ЗаКого = ЗаКого;
	КонецЕсли;
	Запись.ИдКнопки = ИдКнопки;
	Запись.Комментарий = Комментарий;
	Запись.Данные = Данные;
	Если Контекст.Задача <> Неопределено Тогда
		Запись.Итерация = Контекст.Задача.Итерация;
	КонецЕсли;
	Запись.Записать();

КонецПроцедуры

Функция ПоследнийНомерЖурнала(Процесс)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Процесс", Процесс);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(МАКСИМУМ(Журнал.НомерЗаписи), 0) КАК НомерЗаписи
	|ИЗ
	|	РегистрСведений.кбп_ЖурналПроцессов КАК Журнал
	|ГДЕ
	|	Журнал.Процесс = &Процесс";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.НомерЗаписи;

КонецФункции

#КонецОбласти

#КонецОбласти
